# BuiltInFailures.FluidFailures Class

---
Failures about Fluid.
SystemObject Autodesk.Revit.DBBuiltInFailuresFluidFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class FluidFailures

    Public NotInheritable Class FluidFailures

    public ref class FluidFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type FluidFailures = class end
The BuiltInFailuresFluidFailures type exposes the following members.
| Name| Description
---|---|---
| UndefinedFluidType|  The fluid type '[Type Name]' is not defined
Top
#### Reference
Autodesk.Revit.DB Namespace